/* "Системы модули и компоненты" ("СМК"). 2017. Москва.
Библиотека MBee-Arduino.
Распространяется свободно. Надеемся, что программные продукты, созданные
с помощью данной библиотеки будут полезными, однако никакие гарантии, явные или
подразумеваемые не предоставляются. */

#include "MBee.h"

/*********************************************************************
 * Public методы класса MB_ZigBee.
 *********************************************************************/
MB_ZigBee::MB_ZigBee()
{

}
 
/*********************************************************************
 * Переопределенные Public методы класса MB_ZigBee, наследуемые из MBee2400
 *********************************************************************/
void MB_ZigBee::readPacket()
{
}