/*
 12:02:43 64
 12:02:44 65
 12:02:49 -18.75
 12:02:50 -19.24
 12:02:51 -19.24
 12:02:52 -18.75
 12:02:53 -19.24
 12:02:54 -19.24
 12:02:55 -19.24
 12:02:56 -19.73
 12:02:57 -19.73
 12:02:58 -19.73
 12:02:59 -19.24
 12:03:00 -19.73
 12:03:01 -19.73
 12:03:02 -19.73
 12:03:03 -19.24
 12:03:04 -19.73
 12:03:05 -19.24
 12:03:06 -19.73
 12:03:07 -19.73
 12:03:08 -19.24
 12:03:09 -19.73
 12:03:10 -19.73
 12:03:11 -19.73
 12:03:12 -212:11:26  -28.03
 12:11:27 -28.52
 12:11:28 -28.52
 12:11:36 -28.52
 12:11:37 -28.03
 12:11:38 -28.52
 12:11:39 -28.52
 12:11:40 -28.03
 12:11:41 -28.52
 12:11:42 -28.03
 12:11:43 -28.52
 12:11:44 -28.52
 12:11:45 -28.03
 12:11:46 -28.52
 12:11:47 -28.03
 12:11:48 -28.52
 12:11:49 -28.52
 0.21
 12:03:13 -19.73
 12:03:14 -19.73
 12:03:15 276.17
 12:03:16 201.12:10:35  -28.52
 12:10:36 -28.52
 12:10:37 -28.52
 12:10:38 -28.52
 4612:15:42 -28.52
 12:15:43 -28.52
 12:15:44 -28.52
 12:15:45 -28.52
 12:15:52 -28.03
 12:15:53 -28.52
 12:15:54 -28.52
 12:15:55 -28.52
 12:15:56 -28.52
 12:15:57 -28.03
 12:15:58 -28.52
 12:1500:00:00  25.68
 00:00:00 25.68
 :59 -28.52
 12:16:00 -28.52
 
 12:03:17 145.31
 12:03:18 150.68
 12:03:20 -19.73
 12:03:21 -22.66
 12:03:22 -19.73
 12:03:23 -19.73
 12:03:24 -19.73
 12:03:25 -19.73
 12:03:26 -19.73
 12:03:27 -19.73
 
*/
// библиотека для работы I²C
#include <Wire.h>
// библиотека для работы с часами реального времени
#include "troyka-RTC.h"

// EEPROM — энергонезависимая память
// библиотека для записи и считывания информации с EEPROM
#include <EEPROM.h>

#define LEN_TIME 20
 
// создаём объект для работы с часами реального времени
RTC clock;

void setup()
{
  Keyboard.begin();
  clock.begin();
//  clock.set(10,25,45,27,07,2005,THURSDAY);
  clock.set(__TIMESTAMP__);
}

void loop()
{


float voltage = analogRead(A5) * 5.0;
  voltage /= 1024.0;

  float temperatureC = (voltage - 0.5) * 100 ;
  
  char ftime[LEN_TIME];
  clock.read();
  clock.getTimeStr(ftime, LEN_TIME);
  Keyboard.print(ftime);
  Keyboard.press(KEY_TAB);
  Keyboard.release(KEY_TAB);
  
  Keyboard.print(temperatureC);
  Keyboard.press(KEY_RETURN);
  Keyboard.release(KEY_RETURN);
    
  delay(1000);

}
